xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxCpu_reg.h
/** \brief F018, CPUx Trigger Event 3 */
#define CPU1_TR3_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F018u)
/** Alias (User Manual Name) for CPU1_TR3_EVT.
* To use register names with standard convension, please use CPU1_TR3_EVT.
*/
#define CPU1_TR3EVT (CPU1_TR3_EVT)

/** \brief F01C, CPUx Trigger Address 3 */
#define CPU1_TR3_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F01Cu)
/** Alias (User Manual Name) for CPU1_TR3_ADR.
* To use register names with standard convension, please use CPU1_TR3_ADR.
*/
#define CPU1_TR3ADR (CPU1_TR3_ADR)

/** \brief F020, CPUx Trigger Event 4 */
#define CPU1_TR4_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F020u)
/** Alias (User Manual Name) for CPU1_TR4_EVT.
* To use register names with standard convension, please use CPU1_TR4_EVT.
*/
#define CPU1_TR4EVT (CPU1_TR4_EVT)

/** \brief F024, CPUx Trigger Address 4 */
#define CPU1_TR4_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F024u)
/** Alias (User Manual Name) for CPU1_TR4_ADR.
* To use register names with standard convension, please use CPU1_TR4_ADR.
*/
#define CPU1_TR4ADR (CPU1_TR4_ADR)

/** \brief F028, CPUx Trigger Event 5 */
#define CPU1_TR5_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F028u)
/** Alias (User Manual Name) for CPU1_TR5_EVT.
* To use register names with standard convension, please use CPU1_TR5_EVT.
*/
#define CPU1_TR5EVT (CPU1_TR5_EVT)

/** \brief F02C, CPUx Trigger Address 5 */
#define CPU1_TR5_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F02Cu)
/** Alias (User Manual Name) for CPU1_TR5_ADR.
* To use register names with standard convension, please use CPU1_TR5_ADR.
*/
#define CPU1_TR5ADR (CPU1_TR5_ADR)

/** \brief F030, CPUx Trigger Event 6 */
#define CPU1_TR6_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F030u)
/** Alias (User Manual Name) for CPU1_TR6_EVT.
* To use register names with standard convension, please use CPU1_TR6_EVT.
*/
#define CPU1_TR6EVT (CPU1_TR6_EVT)

/** \brief F034, CPUx Trigger Address 6 */
#define CPU1_TR6_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F034u)
/** Alias (User Manual Name) for CPU1_TR6_ADR.
* To use register names with standard convension, please use CPU1_TR6_ADR.
*/
#define CPU1_TR6ADR (CPU1_TR6_ADR)

/** \brief F038, CPUx Trigger Event 7 */
#define CPU1_TR7_EVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F038u)
/** Alias (User Manual Name) for CPU1_TR7_EVT.
* To use register names with standard convension, please use CPU1_TR7_EVT.
*/
#define CPU1_TR7EVT (CPU1_TR7_EVT)

/** \brief F03C, CPUx Trigger Address 7 */
#define CPU1_TR7_ADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F03Cu)
/** Alias (User Manual Name) for CPU1_TR7_ADR.
* To use register names with standard convension, please use CPU1_TR7_ADR.
*/
#define CPU1_TR7ADR (CPU1_TR7_ADR)

/** \brief FC00, CPUx Counter Control */
#define CPU1_CCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CCTRL*)0xF883FC00u)

/** \brief FC04, CPUx CPU Clock Cycle Count */
#define CPU1_CCNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CCNT*)0xF883FC04u)

/** \brief FC08, CPUx Instruction Count */
#define CPU1_ICNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ICNT*)0xF883FC08u)

/** \brief FC0C, CPUx Multi-Count Register 1 */
#define CPU1_M1CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M1CNT*)0xF883FC0Cu)

/** \brief FC10, CPUx Multi-Count Register 2 */
#define CPU1_M2CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M2CNT*)0xF883FC10u)

/** \brief FC14, CPUx Multi-Count Register 3 */
#define CPU1_M3CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_M3CNT*)0xF883FC14u)

/** \brief FD00, CPUx Debug Status Register */
#define CPU1_DBGSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DBGSR*)0xF883FD00u)

/** \brief FD08, CPUx External Event Register */
#define CPU1_EXEVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_EXEVT*)0xF883FD08u)

/** \brief FD0C, CPUx Core Register Access Event */
#define CPU1_CREVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CREVT*)0xF883FD0Cu)

/** \brief FD10, CPUx Software Debug Event */
#define CPU1_SWEVT /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SWEVT*)0xF883FD10u)

/** \brief FD30, CPUx TriggerAddressx */
#define CPU1_TRIG_ACC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_TRIG_ACC*)0xF883FD30u)

/** \brief FD40, CPUx Debug Monitor Start Address */
#define CPU1_DMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DMS*)0xF883FD40u)

/** \brief FD44, CPUx Debug Context Save Area Pointer */
#define CPU1_DCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DCX*)0xF883FD44u)

/** \brief FD48, CPUx Debug Trap Control Register */
#define CPU1_DBGTCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF883FD48u)

/** \brief FE00, CPUx Previous Context Information Register */
#define CPU1_PCXI /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PCXI*)0xF883FE00u)

/** \brief FE04, CPUx Program Status Word */
#define CPU1_PSW /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PSW*)0xF883FE04u)

/** \brief FE08, CPUx Program Counter */
#define CPU1_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_PC*)0xF883FE08u)

/** \brief FE14, CPUx System Configuration Register */
#define CPU1_SYSCON /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_SYSCON*)0xF883FE14u)

/** \brief FE18, CPUx Identification Register TC1.6.2P */
#define CPU1_CPU_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF883FE18u)

/** \brief FE1C, CPUx Core Identification Register */
#define CPU1_CORE_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CORE_ID*)0xF883FE1Cu)

/** \brief FE20, CPUx Base Interrupt Vector Table Pointer */
#define CPU1_BIV /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BIV*)0xF883FE20u)

/** \brief FE24, CPUx Base Trap Vector Table Pointer */
#define CPU1_BTV /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_BTV*)0xF883FE24u)

/** \brief FE28, CPUx Interrupt Stack Pointer */
#define CPU1_ISP /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ISP*)0xF883FE28u)

/** \brief FE2C, CPUx Interrupt Control Register */
#define CPU1_ICR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_ICR*)0xF883FE2Cu)

/** \brief FE38, CPUx Free CSA List Head Pointer */
#define CPU1_FCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FCX*)0xF883FE38u)

/** \brief FE3C, CPUx Free CSA List Limit Pointer */
#define CPU1_LCX /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_LCX*)0xF883FE3Cu)

/** \brief FE50, CPUx Customer ID register */
#define CPU1_CUS_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF883FE50u)

/** \brief FF00, CPUx Data General Purpose Register 0 */
#define CPU1_D0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF883FF00u)

